[
    {
      "company": "GENFIT",
      "title": "Ingénieur IA",
      "range": "Decembre 2024 - Présent",
      "location": "Lille, France",
      "url": "https://www.genfit.fr/",
      "logo": "/images/genfit.png",
      "description": [
        "Développement d’applications d’IA générative pour automatiser les processus internes de l’entreprise.",
        "Conception et déploiement d’un modèle de classification d’images pour identifier diverses pathologies histologiques."
      ]
    },
    {
      "company": "Sanofi",
      "title": "Ingénieur IA",
      "range": "Septembre 2023 - Août 2024",
      "location": "Lyon, France",
      "url": "https://www.sanofi.com/fr",
      "logo": "/images/sanofi.png",
      "description": [
        "Contribué à l'automatisation de la génération de rapports de qualité en utilisant des LLM et RAG, améliorant la précision et réduisant le temps de génération de plus de 50 %.",
        "Développement d'outils personnalisés pour la récupération de données depuis la VDB et pour la génération de représentations graphiques.",
        "Création d'un pipeline d'évaluation pour l'application RAG.",
        "Tech Stack : Python, AWS S3, LangChain, LangGraph, Pinecone, Redis, RAG, Kubernetes."
      ]
    },
    {
      "company": "Ecole des Mines Alès",
      "title": "Ingénieur MLOps - Stagiaire",
      "range": "Janvier - Mars 2024",
      "location": "Alès, France",
      "url": "https://www.imt-mines-ales.fr/fr",
      "logo": "/images/imt.png",
      "description": [
        "Conception et mise en œuvre d'un pipeline MLOps pour automatiser les processus de bout en bout de l'entraînement, évaluation, et déploiement des modèles.",
        "Mise en place de solutions de surveillance de la dérive des données et des modèles, garantissant la stabilité et la performance à long terme des modèles.",
        "Utilisation des services AWS pour des solutions d'entraînement et de déploiement de modèles, rentables et évolutives.",
        "Tech Stack : Python, AWS S3, AWS ECR, AWS SageMaker, AWS Lambda, API Gateway, et GitHub Actions, Docker."
      ]
    },
    {
      "company": "Vaisala",
      "title": "Data Scientist - Stagiaire",
      "range": "Avril - Août 2023",
      "location": "Saclay, France",
      "url": "https://www.vaisala.com/fr",
      "logo": "/images/vaisala.png",
      "description": [
        "Analyse des données des deux produits pour trouver des applications conjointes et améliorer leurs performances.",
        "Réalisation d'études de marché approfondies et développement de méthodes d'étalonnage par apprentissage automatique, améliorant la focalisation et les mesures des produits.",
        "Tech Stack : Python, AWS S3, Bitbucket, scikit-learn"
      ]
    },
    {
      "company": "EuroMov Digital Health in Motion",
      "title": "Ingénieur en apprentissage automatique - Stagiaire",
      "range": "Janvier - Avril 2023",
      "location": "Montpellier, France",
      "url": "https://dhm.euromov.eu/",
      "logo": "/images/euromov.png",
      "description": [
        "Analyse des signaux de spectroscopie proche infrarouge fonctionnelle (fNIRS) de patients subissant une stimulation transcrânienne à courant direct (tDCS).",
        "Identification de biomarqueurs uniques établissant des corrélations entre la dose électrique et les réponses fNIRS, permettant la modulation des doses en fonction des réponses des patients. Ce projet contribue aux futures stratégies de traitement personnalisé pour restaurer les fonctions cognitives chez les patients souffrant de lésions cérébrales.",
        "Tech Stack : Python, Github, scikit-learn, Pytorch"
      ]
    }
  ]
  