[     
    {
      "company": "GENFIT",
      "title": "AI ENGINEER",
      "range": "December 2024 - Present",
      "location": "Lille, France",
      "url": "https://www.genfit.fr/",
      "logo": "/images/genfit.png",
      "description": [
        "Developing and deploying a multi-object detection and tracking solution.",
        "Developing and implementing a solution for classifying and detecting pathological tissues, as well as automating cell counting in microscopic images"
      ]
    },
    {
      "company": "Sanofi",
      "title": "AI ENGINEER",
      "range": "September 2023 - August 2024",
      "location": "Lyon, France",
      "url": "https://www.sanofi.com/en",
      "logo": "/images/sanofi.png",
      "description": [
        "Contributed to the automation of quality report generation using LLMs and RAG, enhancing accuracy and reducing generation time by more than 50%.",
        "Developed custom tools for data retrieval from VDB and for generating graphical representations.",
        "Created an evaluation pipeline for the RAG application.",
        "Tech Stack : Python, AWS S3, LangChain, LangGraph, Pinecone, Redis, RAG, Kubernetes."
      ]
    },
    {
      "company": "Ecole des Mines Alès",
      "title": "MLOps Engineer - intern",
      "range": "January - March 2024",
      "location": "Alès, France",
      "url": "https://www.imt-mines-ales.fr/en",
      "logo": "/images/imt.png",
      "description": [
        "Developed and implemented an MLOps pipeline to automate end-to-end processes for model training, evaluation, and deployment. ",
        "Established data and model drift monitoring solutions, ensuring model stability and long-term performance.",
        "Leveraged AWS services to deliver cost-effective, scalable solutions for model training and deployment.",
        "Tech Stack : Python, AWS S3, AWS ECR, AWS SageMaker, AWS Lambda, API Gateway, and GitHub Actions, Docker."
      ]
    },
    {
      "company": "Vaisala",
      "title": "Data Scientist - intern",
      "range": "April - August 2023",
      "location": "Saclay, France",
      "url": "https://www.vaisala.com/",
      "logo": "/images/vaisala.png",
      "description": [
        "Analyzed data from both products to find joint applications and improve their performance.",
        "Conducted in-depth market research and developed machine learning calibration methods, improving product focus and measurements.",
        "Tech Stack : Python, AWS S3, Bitbucket, scikit-learn"
      ]
    },
    {
      "company": "EuroMov Digital Health in Motion",
      "title": "Machine Learning Engineer - Intern",
      "range": "January - April 2023",
      "location": "Montpellier, France",
      "url": "https://dhm.euromov.eu/",
      "logo": "/images/euromov.png",
      "description": [
        "Analyzed functional near-infrared spectroscopy (fNIRS) signals from patients undergoing transcranial direct current stimulation (tDCS).",
        "Derived unique biomarkers to establish correlations between the electric dosage and fNIRS responses. Enabling dosage modulation based on patient responses, contributing to a future personalized treatment strategies for cognitive function restoration in patients with brain damage. ",
        "Tech Stack : Python, Github, scikit-learn, Pytorch"
      ]
    }
  ]
  