[
    {
      "company": "Sanofi",
      "title": "Data Scientist",
      "range": "Sept 2023 - Currently",
      "location": "Lyon, France",
      "url": "https://www.sanofi.com/en",
      "description": [
        "Automated the generation of quality reports using LLMs, enhancing accuracy and reducing generation time by more than 50%.",
        "Revamped the creation of agent tools, resulting in a 10-second gain per prompt"
      ]
    },
    {
      "company": "Ecole des Mines Alès",
      "title": "MLOps Engineer - intern",
      "range": "Jan - March 2024",
      "location": "Alès, France",
      "url": "https://www.imt-mines-ales.fr/en",
      "description": [
        "Developed an MLOps pipeline to automate the end-to-end process of model training, evaluation, and deployment, effectively handling a variety of ML problems.",
        "Integrated data drift and model drift monitoring solutions to ensure model reliability and performance over time, utilizing custom metrics.",
        "Tech Stack : Python, AWS S3, AWS ECR, AWS SageMaker, AWS Lambda, API Gateway, and GitHub Actions, Docker."
      ]
    },
    {
      "company": "Vaisala",
      "title": "Data Scientist",
      "range": "April - August 2023",
      "location": "Saclay, France",
      "url": "https://www.vaisala.com/",
      "description": [
        "Analyzed data from both products to find joint applications and improve their performance.",
        "Conducted in-depth market research and developed machine learning calibration methods, improving product focus and measurements."
      ]
    },
    {
      "company": "EuroMov Digital Health in Motion",
      "title": "Machine Learning Engineer - Intern",
      "range": "Jan - April 2023",
      "location": "Montpellier, France",
      "url": "https://dhm.euromov.eu/",
      "description": [
        "Analyzed functional near-infrared spectroscopy (fNIRS) signals from patients undergoing transcranial direct current stimulation (tDCS).",
        "Derived unique biomarkers to establish correlations between the electric dosage and fNIRS responses. Enabling dosage modulation based",
        "on patient responses, contributing to a future real time personalized treatment strategies for cognitive function restoration in patients with brain damage."
      ]
    }
  ]
  